jmeter/report_B/statistics.json
{
  "B1 - POST /applications/submit" : {
    "transaction" : "B1 - POST /applications/submit",
    "sampleCount" : 8066,
    "errorCount" : 4852,
    "errorPct" : 60.153732,
    "meanResTime" : 543.4129680138876,
    "medianResTime" : 522.0,
    "minResTime" : 4.0,
    "maxResTime" : 1896.0,
    "pct1ResTime" : 868.0,
    "pct2ResTime" : 1013.6499999999996,
    "pct3ResTime" : 1269.6599999999999,
    "throughput" : 135.0500619495697,
    "receivedKBytesPerSec" : 28.928231894401097,
    "sentKBytesPerSec" : 138.34011909595486
  },
  "A1 - POST /jobs/search" : {
    "transaction" : "A1 - POST /jobs/search",
    "sampleCount" : 9248,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 137.50551470588195,
    "medianResTime" : 118.0,
    "minResTime" : 1.0,
    "maxResTime" : 771.0,
    "pct1ResTime" : 257.0,
    "pct2ResTime" : 320.0,
    "pct3ResTime" : 538.0,
    "throughput" : 155.35807280729753,
    "receivedKBytesPerSec" : 756.9506438517395,
    "sentKBytesPerSec" : 35.62734662422094
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 26512,
    "errorCount" : 4852,
    "errorPct" : 18.301147,
    "meanResTime" : 271.67214846107447,
    "medianResTime" : 186.0,
    "minResTime" : 1.0,
    "maxResTime" : 1896.0,
    "pct1ResTime" : 647.0,
    "pct2ResTime" : 771.0,
    "pct3ResTime" : 1019.9800000000032,
    "throughput" : 443.89378160265215,
    "receivedKBytesPerSec" : 919.3329878319325,
    "sentKBytesPerSec" : 211.89839851990757
  },
  "A2 - POST /jobs/get" : {
    "transaction" : "A2 - POST /jobs/get",
    "sampleCount" : 9198,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 168.27049358556178,
    "medianResTime" : 145.0,
    "minResTime" : 1.0,
    "maxResTime" : 841.0,
    "pct1ResTime" : 305.0,
    "pct2ResTime" : 397.0,
    "pct3ResTime" : 671.0100000000002,
    "throughput" : 155.47141746391267,
    "receivedKBytesPerSec" : 137.2724633474612,
    "sentKBytesPerSec" : 38.41237169762685
  }
}