jmeter/report_B2/statistics.json
{
  "A1 - POST /jobs/search" : {
    "transaction" : "A1 - POST /jobs/search",
    "sampleCount" : 11938,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 123.77198860780715,
    "medianResTime" : 114.0,
    "minResTime" : 1.0,
    "maxResTime" : 585.0,
    "pct1ResTime" : 189.0,
    "pct2ResTime" : 228.0,
    "pct3ResTime" : 311.6100000000006,
    "throughput" : 200.11734137959937,
    "receivedKBytesPerSec" : 1917.6080824113653,
    "sentKBytesPerSec" : 47.06271674105272
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 54253,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 100.60752400788873,
    "medianResTime" : 89.0,
    "minResTime" : 1.0,
    "maxResTime" : 615.0,
    "pct1ResTime" : 135.0,
    "pct2ResTime" : 157.0,
    "pct3ResTime" : 218.0,
    "throughput" : 909.4307362210004,
    "receivedKBytesPerSec" : 4584.786205232919,
    "sentKBytesPerSec" : 295.95524103820236
  },
  "B2 - POST /jobs/search" : {
    "transaction" : "B2 - POST /jobs/search",
    "sampleCount" : 15197,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 127.02480752780194,
    "medianResTime" : 118.0,
    "minResTime" : 1.0,
    "maxResTime" : 574.0,
    "pct1ResTime" : 192.0,
    "pct2ResTime" : 227.0,
    "pct3ResTime" : 293.0,
    "throughput" : 255.62227716943363,
    "receivedKBytesPerSec" : 2454.6229017646883,
    "sentKBytesPerSec" : 65.1537249425998
  },
  "A2 - POST /jobs/get" : {
    "transaction" : "A2 - POST /jobs/get",
    "sampleCount" : 11885,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 133.8744636095921,
    "medianResTime" : 122.0,
    "minResTime" : 1.0,
    "maxResTime" : 603.0,
    "pct1ResTime" : 203.0,
    "pct2ResTime" : 252.0,
    "pct3ResTime" : 359.41999999999825,
    "throughput" : 200.16842105263157,
    "receivedKBytesPerSec" : 176.72013157894736,
    "sentKBytesPerSec" : 50.04210526315789
  },
  "B1 - POST /events/ingest" : {
    "transaction" : "B1 - POST /events/ingest",
    "sampleCount" : 15233,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 30.143504234228324,
    "medianResTime" : 19.0,
    "minResTime" : 2.0,
    "maxResTime" : 615.0,
    "pct1ResTime" : 63.0,
    "pct2ResTime" : 94.0,
    "pct3ResTime" : 204.65999999999985,
    "throughput" : 255.55294591330025,
    "receivedKBytesPerSec" : 45.17097969756576,
    "sentKBytesPerSec" : 134.26512197398
  }
}