jmeter/report_BSK/statistics.json
{
  "B1 - POST /applications/submit" : {
    "transaction" : "B1 - POST /applications/submit",
    "sampleCount" : 6001,
    "errorCount" : 5768,
    "errorPct" : 96.11732,
    "meanResTime" : 755.4605899016833,
    "medianResTime" : 725.0,
    "minResTime" : 5.0,
    "maxResTime" : 3494.0,
    "pct1ResTime" : 1114.8000000000002,
    "pct2ResTime" : 1286.0,
    "pct3ResTime" : 2646.799999999952,
    "throughput" : 100.09841370452537,
    "receivedKBytesPerSec" : 20.17586823510033,
    "sentKBytesPerSec" : 102.54407961814648
  },
  "A1 - POST /jobs/search" : {
    "transaction" : "A1 - POST /jobs/search",
    "sampleCount" : 6792,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 241.40680212014098,
    "medianResTime" : 216.0,
    "minResTime" : 2.0,
    "maxResTime" : 1570.0,
    "pct1ResTime" : 424.0,
    "pct2ResTime" : 515.0,
    "pct3ResTime" : 1087.1399999999994,
    "throughput" : 113.74217101517233,
    "receivedKBytesPerSec" : 554.3253571189337,
    "sentKBytesPerSec" : 26.084116188205446
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 19537,
    "errorCount" : 5768,
    "errorPct" : 29.523468,
    "meanResTime" : 397.57076316732446,
    "medianResTime" : 275.0,
    "minResTime" : 2.0,
    "maxResTime" : 3494.0,
    "pct1ResTime" : 885.0,
    "pct2ResTime" : 1036.0999999999985,
    "pct3ResTime" : 1438.0,
    "throughput" : 325.8828042901703,
    "receivedKBytesPerSec" : 671.6283467435906,
    "sentKBytesPerSec" : 156.3184804048306
  },
  "A2 - POST /jobs/get" : {
    "transaction" : "A2 - POST /jobs/get",
    "sampleCount" : 6744,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 236.38582443653578,
    "medianResTime" : 216.0,
    "minResTime" : 3.0,
    "maxResTime" : 1581.0,
    "pct1ResTime" : 415.0,
    "pct2ResTime" : 499.0,
    "pct3ResTime" : 1054.6500000000005,
    "throughput" : 113.35215812827754,
    "receivedKBytesPerSec" : 100.0780416172936,
    "sentKBytesPerSec" : 28.005953131302945
  }
}